#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602108083]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602108078]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602108084]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602108103]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602108077]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602108093]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602108097]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602108099]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602108105]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113601947038]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602108104]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602108100]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602108080]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602108079]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602108082]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602108098]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602108106]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602108095]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602108085]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602108088]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602108081]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602108087]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602108089]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602108108]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602108122]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602108120]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602108121]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602108118]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602108115]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602108119]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602108116]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602108117]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602108156]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602108143]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602108163]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602108082" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602108143" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602108080" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602108156" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602108079" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602108163" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108088" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602108120" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108098" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602108115" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108087" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602108122" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108081" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602108117" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108095" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602108121" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108089" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602108116" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108106" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602108118" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602108085" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602108119" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602108082",
        ] -> (known after apply)
        id                = "113602108143"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602108080",
        ] -> (known after apply)
        id                = "113602108156"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602108079",
        ] -> (known after apply)
        id                = "113602108163"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108088",
          - "113602108104",
        ] -> (known after apply)
        id                = "113602108120"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108098",
          - "113602108097",
        ] -> (known after apply)
        id                = "113602108115"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108087",
          - "113602108100",
        ] -> (known after apply)
        id                = "113602108122"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108081",
          - "113602108077",
        ] -> (known after apply)
        id                = "113602108117"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108095",
          - "113602108099",
        ] -> (known after apply)
        id                = "113602108121"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108089",
          - "113602108105",
        ] -> (known after apply)
        id                = "113602108116"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108106",
          - "113602108103",
        ] -> (known after apply)
        id                = "113602108118"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602108085",
          - "113602108093",
        ] -> (known after apply)
        id                = "113602108119"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 11 to add, 11 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>